In [1]:
# Name : Chaithra Kopparam Cheluvaiah
# Nov 28, 2021

# PANDAS - OPERATIONS
There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category.
- col.unique() : values in a column of a dataframe
- col.nunique() : number of unique values in the column
- col.value_counts() : similar to Counter python library
- apply() : applying with custom and built-in functions
- df.columns and df.index attributes of dataframe
- df.sort_values(col)
- pivot_table()

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
# finding unique values in column of a dataframe
df['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [8]:
# finding number of unique values in a dataframe
len(df['col2'].unique())

3

In [9]:
df['col2'].nunique()

3

In [10]:
# Counter 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
# conditional selection
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [14]:
# conditional selection with multiple conditions
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [22]:
# apply method : most powerful tool
def times2(x:int):
    return x*2

In [20]:
df['col1'].sum() # using built in function sum() to a column

10

In [23]:
# applying custom function to each data poing for a column
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
# using lamba with apply()
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [25]:
# applying built in function 
df['col3'].apply(len) #length of each string in a column

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [26]:
# dropping the column
df.drop('col1', axis=1, inplace=False)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [27]:
# to get column and index names of a dataframe

df.columns  # attribute of dataframe itself

Index(['col1', 'col2', 'col3'], dtype='object')

In [30]:
df.index #in our case its range index so it retursn rangeIndex object

RangeIndex(start=0, stop=4, step=1)

In [29]:
#SORTING & ORDERING DATAFRAME
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
# really useful way to find null values in dataframe
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [32]:
df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
# creating pivot tables

# example dataframe
data = {
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [36]:
df.pivot_table(values='D', index=['A','B'], columns=['C']) # creating multi index out of the daframe

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN